In [1]:
import pandas as pd

In [3]:
people = {
    'first': ['sheldon','lenord','rajesh'],
    'second': ['cooper','hofstader','kootrapali'],
    'email': ['sheldon.cooper@email.com','lenord.hofstader@email.com','rajesh.kootrapali@email.com']
}

In [4]:
df = pd.DataFrame(people)

In [5]:
df

     first      second                        email
0  sheldon      cooper     sheldon.cooper@email.com
1   lenord   hofstader   lenord.hofstader@email.com
2   rajesh  kootrapali  rajesh.kootrapali@email.com

In [6]:
df['email']

0       sheldon.cooper@email.com
1     lenord.hofstader@email.com
2    rajesh.kootrapali@email.com
Name: email, dtype: object

In [7]:
type(df['email'])

pandas.core.series.Series

In [8]:
df.email

0       sheldon.cooper@email.com
1     lenord.hofstader@email.com
2    rajesh.kootrapali@email.com
Name: email, dtype: object

In [10]:
df[['second','email']]

       second                        email
0      cooper     sheldon.cooper@email.com
1   hofstader   lenord.hofstader@email.com
2  kootrapali  rajesh.kootrapali@email.com

In [11]:
df.columns

Index(['first', 'second', 'email'], dtype='object')

In [12]:
df.iloc[0]

first                      sheldon
second                      cooper
email     sheldon.cooper@email.com
Name: 0, dtype: object

In [13]:
df.iloc[[0,1]]

     first     second                       email
0  sheldon     cooper    sheldon.cooper@email.com
1   lenord  hofstader  lenord.hofstader@email.com

In [14]:
df.iloc[[0,1],2]

0      sheldon.cooper@email.com
1    lenord.hofstader@email.com
Name: email, dtype: object

In [15]:
df.loc[0]

first                      sheldon
second                      cooper
email     sheldon.cooper@email.com
Name: 0, dtype: object

In [16]:
df.loc[[0,1]]

     first     second                       email
0  sheldon     cooper    sheldon.cooper@email.com
1   lenord  hofstader  lenord.hofstader@email.com

In [17]:
df.loc[[0,1],'email']

0      sheldon.cooper@email.com
1    lenord.hofstader@email.com
Name: email, dtype: object

In [18]:
df.loc[[0,1],['second','email']]

      second                       email
0     cooper    sheldon.cooper@email.com
1  hofstader  lenord.hofstader@email.com

In [19]:
df['email']

0       sheldon.cooper@email.com
1     lenord.hofstader@email.com
2    rajesh.kootrapali@email.com
Name: email, dtype: object

In [20]:
df.set_index('email')

                               first      second
email
sheldon.cooper@email.com     sheldon      cooper
lenord.hofstader@email.com    lenord   hofstader
rajesh.kootrapali@email.com   rajesh  kootrapali

In [21]:
df

     first      second                        email
0  sheldon      cooper     sheldon.cooper@email.com
1   lenord   hofstader   lenord.hofstader@email.com
2   rajesh  kootrapali  rajesh.kootrapali@email.com

In [22]:
df.set_index('email',inplace=True)

In [23]:
df

                               first      second
email
sheldon.cooper@email.com     sheldon      cooper
lenord.hofstader@email.com    lenord   hofstader
rajesh.kootrapali@email.com   rajesh  kootrapali

In [24]:
df.index

Index(['sheldon.cooper@email.com', 'lenord.hofstader@email.com',
       'rajesh.kootrapali@email.com'],
      dtype='object', name='email')

In [25]:
df.loc['sheldon.cooper@email.com']

first     sheldon
second     cooper
Name: sheldon.cooper@email.com, dtype: object

In [26]:
df.loc['sheldon.cooper@email.com','second']

'cooper'

In [27]:
df.loc[0]

KeyError: 0

In [28]:
df.iloc[0]

first     sheldon
second     cooper
Name: sheldon.cooper@email.com, dtype: object

In [29]:
df.reset_index()

                         email    first      second
0     sheldon.cooper@email.com  sheldon      cooper
1   lenord.hofstader@email.com   lenord   hofstader
2  rajesh.kootrapali@email.com   rajesh  kootrapali

In [30]:
df.reset_index(inplace=True)

In [31]:
df

                         email    first      second
0     sheldon.cooper@email.com  sheldon      cooper
1   lenord.hofstader@email.com   lenord   hofstader
2  rajesh.kootrapali@email.com   rajesh  kootrapali

In [32]:
df['second'] == 'cooper'

0     True
1    False
2    False
Name: second, dtype: bool

In [34]:
df['second'] == ['kootrapali','cooper']

ValueError: ('Lengths must match to compare', (3,), (2,))

In [35]:
df['second'] in ['kootrapali','cooper']

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [36]:
filt = (df['second'] == 'cooper')

In [37]:
df[filt]

                      email    first  second
0  sheldon.cooper@email.com  sheldon  cooper

In [38]:
df.loc[filt]

                      email    first  second
0  sheldon.cooper@email.com  sheldon  cooper

In [39]:
df.loc[filt,'email']

0    sheldon.cooper@email.com
Name: email, dtype: object

In [40]:
df.count()

email     3
first     3
second    3
dtype: int64

In [41]:
filt = (df['second'] == 'cooper') & (df['first'] == 'sheldon')

In [42]:
df[filt]

                      email    first  second
0  sheldon.cooper@email.com  sheldon  cooper

In [44]:
filt = (df['second'] == 'cooper') | (df['second'] == 'hofstader')

In [45]:
df[filt]

                        email    first     second
0    sheldon.cooper@email.com  sheldon     cooper
1  lenord.hofstader@email.com   lenord  hofstader

In [46]:
filt = (df['second'] == 'hofstader') | (df['first'] == 'rajesh')

In [47]:
df[filt]

                         email   first      second
1   lenord.hofstader@email.com  lenord   hofstader
2  rajesh.kootrapali@email.com  rajesh  kootrapali

In [49]:
filt = (df['second'] == 'cooper')

In [52]:
df[~filt,'email']

TypeError: '(0    False
1     True
2     True
Name: second, dtype: bool, 'email')' is an invalid key

In [53]:
df.loc[~filt,'email']

1     lenord.hofstader@email.com
2    rajesh.kootrapali@email.com
Name: email, dtype: object

In [54]:
df.columns

Index(['email', 'first', 'second'], dtype='object')

In [62]:
df.columns = ['email','second_name','first_name']

In [63]:
df.columns

Index(['email', 'second_name', 'first_name'], dtype='object')

In [64]:
df

                         email second_name  first_name
0     sheldon.cooper@email.com     sheldon      cooper
1   lenord.hofstader@email.com      lenord   hofstader
2  rajesh.kootrapali@email.com      rajesh  kootrapali

In [65]:
df.columns = [x.upper() for x in df.columns]

In [66]:
df

                         EMAIL SECOND_NAME  FIRST_NAME
0     sheldon.cooper@email.com     sheldon      cooper
1   lenord.hofstader@email.com      lenord   hofstader
2  rajesh.kootrapali@email.com      rajesh  kootrapali

In [67]:
df.columns = df.columns.str.replace('_', ' ')

In [68]:
df

                         EMAIL SECOND NAME  FIRST NAME
0     sheldon.cooper@email.com     sheldon      cooper
1   lenord.hofstader@email.com      lenord   hofstader
2  rajesh.kootrapali@email.com      rajesh  kootrapali

In [69]:
df.columns

Index(['EMAIL', 'SECOND NAME', 'FIRST NAME'], dtype='object')

In [70]:
df.columns = [x.lower() for x in df.columns]
df.columns = df.columns.str.replace(' ', '_')

In [71]:
df

                         email second_name  first_name
0     sheldon.cooper@email.com     sheldon      cooper
1   lenord.hofstader@email.com      lenord   hofstader
2  rajesh.kootrapali@email.com      rajesh  kootrapali

In [72]:
df.rename(columns={'second_name':'first_name','first_name':'second_name'},inplace=True)

In [73]:
df

                         email first_name second_name
0     sheldon.cooper@email.com    sheldon      cooper
1   lenord.hofstader@email.com     lenord   hofstader
2  rajesh.kootrapali@email.com     rajesh  kootrapali

In [80]:
people = {
    'first': ['Corey','Jane','John'],
    'last': ['Schafer','Doe','Doe'],
    'email': ['CoreyMSchafer@gmail.com','JaneDoe@email.com','JohnDoe@email.com']
}

In [81]:
df = pd.DataFrame(people)

In [82]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [83]:
df.loc[2]

first                 John
last                   Doe
email    JohnDoe@email.com
Name: 2, dtype: object

In [84]:
df.loc[2] = ['John','Smith','JohnSmith@email.com']

In [85]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith      JohnSmith@email.com

In [87]:
df.loc[2,['last','email']] = ['Doe','JohnDoe@email.com']

In [88]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [89]:
df.loc[2,'last'] = 'Smith'

In [90]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith        JohnDoe@email.com

In [91]:
df.at[2,'last'] = 'Doe'

In [92]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [93]:
filt = (df['email'] == 'JohnDoe@email.com')

In [94]:
df[filt]

  first last              email
2  John  Doe  JohnDoe@email.com

In [95]:
df[filt]['last']

2    Doe
Name: last, dtype: object

In [98]:
df[filt]['list'] = 'Smith'

d:\envs\ds\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [99]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [100]:
df.loc[filt,'last'] = 'Smith'

In [101]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith        JohnDoe@email.com

In [102]:
df['email'].str.lower()

0    coreymschafer@gmail.com
1          janedoe@email.com
2          johndoe@email.com
Name: email, dtype: object

In [103]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith        JohnDoe@email.com

In [104]:
df['email'] = df['email'].str.lower()

In [105]:
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2   John    Smith        johndoe@email.com

In [106]:
df['email'].apply(len)

0    23
1    17
2    17
Name: email, dtype: int64

In [107]:
def update_email(email):
    return email.upper()

In [108]:
df['email'].apply(update_email)

0    COREYMSCHAFER@GMAIL.COM
1          JANEDOE@EMAIL.COM
2          JOHNDOE@EMAIL.COM
Name: email, dtype: object

In [109]:
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2   John    Smith        johndoe@email.com

In [110]:
df['email'] = df['email'].apply(update_email)

In [111]:
df

   first     last                    email
0  Corey  Schafer  COREYMSCHAFER@GMAIL.COM
1   Jane      Doe        JANEDOE@EMAIL.COM
2   John    Smith        JOHNDOE@EMAIL.COM

In [112]:
df['email'] = df['email'].apply(lambda x: x.lower())

In [113]:
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2   John    Smith        johndoe@email.com

In [114]:
df['email'].apply(len)

0    23
1    17
2    17
Name: email, dtype: int64

In [115]:
df.apply(len)

first    3
last     3
email    3
dtype: int64

In [116]:
len(df['email'])

3

In [117]:
df.apply(len,axis='columns')

0    3
1    3
2    3
dtype: int64

In [119]:
df.apply(pd.Series.min)

first                      Corey
last                         Doe
email    coreymschafer@gmail.com
dtype: object

In [120]:
df.apply(pd.Series.min, axis='columns')

0    Corey
1      Doe
2     John
dtype: object

In [121]:
df.apply(lambda x: x.min())

first                      Corey
last                         Doe
email    coreymschafer@gmail.com
dtype: object

In [122]:
df.applymap(len)

   first  last  email
0      5     7     23
1      4     3     17
2      4     5     17

In [123]:
df.applymap.str.lower()

AttributeError: 'function' object has no attribute 'str'

In [124]:
df.applymap(str.lower)

   first     last                    email
0  corey  schafer  coreymschafer@gmail.com
1   jane      doe        janedoe@email.com
2   john    smith        johndoe@email.com

In [125]:
df['first'].map({'Corey':'Chris','Jane':'Mary'})

0    Chris
1     Mary
2      NaN
Name: first, dtype: object

In [126]:
df['first'].replace({'Corey':'Chris','Jane':'Mary'})

0    Chris
1     Mary
2     John
Name: first, dtype: object

In [127]:
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2   John    Smith        johndoe@email.com

In [129]:
x = {'a':['1','2','3-4','5-7']}
dfx = pd.DataFrame(x)

In [130]:
dfx

     a
0    1
1    2
2  3-4
3  5-7

In [133]:
dfx['b'] = dfx['a'].map(lambda x: 0 if '-' in x else 1)

In [134]:
dfx['b']

0    1
1    1
2    0
3    0
Name: b, dtype: int64

In [135]:
dfx['a'] = dfx['a'].map(lambda x: x.split('-')[1] if '-' in x else x)

In [136]:
dfx

   a  b
0  1  1
1  2  1
2  4  0
3  7  0

In [137]:
df

   first     last                    email  b
0  Corey  Schafer  coreymschafer@gmail.com  1
1   Jane      Doe        janedoe@email.com  1
2   John    Smith        johndoe@email.com  0

In [138]:
df['first'] + ' ' + df['last']

0    Corey Schafer
1         Jane Doe
2       John Smith
dtype: object

In [139]:
df['full_name'] = df['first'] + ' ' + df['last']

In [140]:
df

   first     last                    email  b      full_name
0  Corey  Schafer  coreymschafer@gmail.com  1  Corey Schafer
1   Jane      Doe        janedoe@email.com  1       Jane Doe
2   John    Smith        johndoe@email.com  0     John Smith

In [141]:
df.drop(columns=['b'])

   first     last                    email      full_name
0  Corey  Schafer  coreymschafer@gmail.com  Corey Schafer
1   Jane      Doe        janedoe@email.com       Jane Doe
2   John    Smith        johndoe@email.com     John Smith

In [142]:
df

   first     last                    email  b      full_name
0  Corey  Schafer  coreymschafer@gmail.com  1  Corey Schafer
1   Jane      Doe        janedoe@email.com  1       Jane Doe
2   John    Smith        johndoe@email.com  0     John Smith

In [143]:
df.drop(columns=['b'],inplace=True)

In [144]:
df

   first     last                    email      full_name
0  Corey  Schafer  coreymschafer@gmail.com  Corey Schafer
1   Jane      Doe        janedoe@email.com       Jane Doe
2   John    Smith        johndoe@email.com     John Smith

In [145]:
df.drop(columns=['first', 'last'],inplace=True)

In [146]:
df

                     email      full_name
0  coreymschafer@gmail.com  Corey Schafer
1        janedoe@email.com       Jane Doe
2        johndoe@email.com     John Smith

In [148]:
df['full_name'].str.split()

0    [Corey, Schafer]
1         [Jane, Doe]
2       [John, Smith]
Name: full_name, dtype: object

In [149]:
df['full_name'].str.split(' ',expand=True)

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John    Smith

In [150]:
df[['first','last']] = df['full_name'].str.split(' ',expand=True)

In [151]:
df

                     email      full_name  first     last
0  coreymschafer@gmail.com  Corey Schafer  Corey  Schafer
1        janedoe@email.com       Jane Doe   Jane      Doe
2        johndoe@email.com     John Smith   John    Smith

In [152]:
df.append({'first':'Tony'})

TypeError: Can only append a dict if ignore_index=True

In [153]:
df.append({'first':'Tony'}, ignore_index=True)

                     email      full_name  first     last
0  coreymschafer@gmail.com  Corey Schafer  Corey  Schafer
1        janedoe@email.com       Jane Doe   Jane      Doe
2        johndoe@email.com     John Smith   John    Smith
3                      NaN            NaN   Tony      NaN

In [154]:
df

                     email      full_name  first     last
0  coreymschafer@gmail.com  Corey Schafer  Corey  Schafer
1        janedoe@email.com       Jane Doe   Jane      Doe
2        johndoe@email.com     John Smith   John    Smith

In [155]:

people = {
    'first': ['Tony','Steve'],
    'last': ['Stark','Rogers'],
    'email': ['IronMan@avenge.com','Cap@avenge.com']
}
df2 = pd.DataFrame(people)

In [156]:
df2

   first    last               email
0   Tony   Stark  IronMan@avenge.com
1  Steve  Rogers      Cap@avenge.com

In [157]:
df.append(df2, ignore_index=True)

                     email      full_name  first     last
0  coreymschafer@gmail.com  Corey Schafer  Corey  Schafer
1        janedoe@email.com       Jane Doe   Jane      Doe
2        johndoe@email.com     John Smith   John    Smith
3       IronMan@avenge.com            NaN   Tony    Stark
4           Cap@avenge.com            NaN  Steve   Rogers

In [158]:
df

                     email      full_name  first     last
0  coreymschafer@gmail.com  Corey Schafer  Corey  Schafer
1        janedoe@email.com       Jane Doe   Jane      Doe
2        johndoe@email.com     John Smith   John    Smith

In [159]:
df = df.append(df2, ignore_index=True)

In [160]:
df

                     email      full_name  first     last
0  coreymschafer@gmail.com  Corey Schafer  Corey  Schafer
1        janedoe@email.com       Jane Doe   Jane      Doe
2        johndoe@email.com     John Smith   John    Smith
3       IronMan@avenge.com            NaN   Tony    Stark
4           Cap@avenge.com            NaN  Steve   Rogers

In [161]:
df.drop(index=4)

                     email      full_name  first     last
0  coreymschafer@gmail.com  Corey Schafer  Corey  Schafer
1        janedoe@email.com       Jane Doe   Jane      Doe
2        johndoe@email.com     John Smith   John    Smith
3       IronMan@avenge.com            NaN   Tony    Stark

In [165]:
df.loc[2,'last'] = 'Doe'

In [166]:
df

                     email      full_name  first     last
0  coreymschafer@gmail.com  Corey Schafer  Corey  Schafer
1        janedoe@email.com       Jane Doe   Jane      Doe
2        johndoe@email.com     John Smith   John      Doe
3       IronMan@avenge.com            NaN   Tony    Stark
4           Cap@avenge.com            NaN  Steve   Rogers

In [168]:
df.drop(index=df[df['last'] == 'Doe'].index)

                     email      full_name  first     last
0  coreymschafer@gmail.com  Corey Schafer  Corey  Schafer
3       IronMan@avenge.com            NaN   Tony    Stark
4           Cap@avenge.com            NaN  Steve   Rogers

In [169]:
filt = (df['last'] == 'Doe')

In [170]:
df.drop(index=df[filt].index)

                     email      full_name  first     last
0  coreymschafer@gmail.com  Corey Schafer  Corey  Schafer
3       IronMan@avenge.com            NaN   Tony    Stark
4           Cap@avenge.com            NaN  Steve   Rogers

In [196]:
people = {
    'first': ['Corey','Jane','John','Adam','Adam','Ada'],
    'last': ['Schafer','Doe','Doe','Doe','Doe','Doe'],
    'email': ['CoreyMSchafer@gmail.com','JaneDoe@email.com','JohnDoe@email.com','A@email.com','A@email.com','A@email.com']
}

In [197]:
df = pd.DataFrame(people)

In [180]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com
3   Adam      Doe              A@email.com

In [181]:
df.sort_values(by='last')

   first     last                    email
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com
3   Adam      Doe              A@email.com
0  Corey  Schafer  CoreyMSchafer@gmail.com

In [182]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com
3   Adam      Doe              A@email.com

In [183]:
df.sort_values(by='last',ascending=False)

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com
3   Adam      Doe              A@email.com

In [184]:
df.sort_values(by=['last','first'],ascending=False)

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
2   John      Doe        JohnDoe@email.com
1   Jane      Doe        JaneDoe@email.com
3   Adam      Doe              A@email.com

In [185]:
df.sort_values(by=['last','first'],ascending=[False,True])

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
3   Adam      Doe              A@email.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [186]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com
3   Adam      Doe              A@email.com

In [187]:
df.sort_values(by=['last','first'],ascending=[False,True],inplace=True)

In [188]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
3   Adam      Doe              A@email.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [189]:
df.sort_index()

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com
3   Adam      Doe              A@email.com

In [190]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
3   Adam      Doe              A@email.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [191]:
df.sort_index(inplace=True)

In [192]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com
3   Adam      Doe              A@email.com

In [193]:
df['first'].sort_values()

3     Adam
0    Corey
1     Jane
2     John
Name: first, dtype: object

In [200]:
df['last'].value_counts()

Doe        5
Schafer    1
Name: last, dtype: int64

In [198]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com
3   Adam      Doe              A@email.com
4   Adam      Doe              A@email.com
5    Ada      Doe              A@email.com

In [1]:
import pandas as pd
import numpy as np

In [2]:
people = {
    'first': ['Corey','Jane','John','Chris',np.nan,None,'Na'],
    'last': ['Schafer','Doe','Doe','Schafer',np.nan,np.nan,'Missing'],
    'email': ['CoreyMSchafer@gmail.com','JaneDoe@email.com','JohnDoe@email.com',None,np.nan,'Anonymous@email.com','NA'],
    'age': ['33','55','63','36',None,None,'Missing']
}

In [3]:
df = pd.DataFrame(people)

In [4]:
df

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
3  Chris  Schafer                     None       36
4    NaN      NaN                      NaN     None
5   None      NaN      Anonymous@email.com     None
6     Na  Missing                       NA  Missing

In [5]:
df.dropna()

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
6     Na  Missing                       NA  Missing

In [6]:
df

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
3  Chris  Schafer                     None       36
4    NaN      NaN                      NaN     None
5   None      NaN      Anonymous@email.com     None
6     Na  Missing                       NA  Missing

In [7]:
df.dropna(axis='index',how='any')

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
6     Na  Missing                       NA  Missing

In [9]:
df.dropna(axis='columns')

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6]

In [10]:
df.dropna(how='all')

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
3  Chris  Schafer                     None       36
5   None      NaN      Anonymous@email.com     None
6     Na  Missing                       NA  Missing

In [12]:
df.dropna(axis='columns',how='all')

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
3  Chris  Schafer                     None       36
4    NaN      NaN                      NaN     None
5   None      NaN      Anonymous@email.com     None
6     Na  Missing                       NA  Missing

In [13]:
df.dropna(subset=['email'])

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
5   None      NaN      Anonymous@email.com     None
6     Na  Missing                       NA  Missing

In [15]:
df.dropna(how='all',subset=['email','last'])

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
3  Chris  Schafer                     None       36
5   None      NaN      Anonymous@email.com     None
6     Na  Missing                       NA  Missing

In [16]:
df.dropna(how='any',subset=['email','last'])

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
6     Na  Missing                       NA  Missing

In [19]:
df.replace('NA',np.nan,inplace=True)
df.replace('Na',np.nan,inplace=True)
df.replace('Missing',np.nan,inplace=True)

In [20]:
df

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@email.com    55
2   John      Doe        JohnDoe@email.com    63
3  Chris  Schafer                     None    36
4    NaN      NaN                      NaN  None
5   None      NaN      Anonymous@email.com  None
6    NaN      NaN                      NaN   NaN

In [21]:
df.isna()

   first   last  email    age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False   True  False
4   True   True   True   True
5   True   True  False   True
6   True   True   True   True

In [24]:
df.loc[[True,False,True,True,False,True,False]]

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
2   John      Doe        JohnDoe@email.com    63
3  Chris  Schafer                     None    36
5   None      NaN      Anonymous@email.com  None

In [25]:
df.fillna(0)

   first     last                    email age
0  Corey  Schafer  CoreyMSchafer@gmail.com  33
1   Jane      Doe        JaneDoe@email.com  55
2   John      Doe        JohnDoe@email.com  63
3  Chris  Schafer                        0  36
4      0        0                        0   0
5      0        0      Anonymous@email.com   0
6      0        0                        0   0

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   first   4 non-null      object
 1   last    4 non-null      object
 2   email   4 non-null      object
 3   age     4 non-null      object
dtypes: object(4)
memory usage: 352.0+ bytes

In [27]:
df.dtypes

first    object
last     object
email    object
age      object
dtype: object

In [28]:
df['age'].mean()

TypeError: can only concatenate str (not "int") to str

In [29]:
type(np.nan)

float

In [30]:
df['age'] = df['age'].astype(int)

TypeError: int() argument must be a string, a bytes-like object or a number, not 'NoneType'

In [32]:
df['age'] = df['age'].astype(float)

In [33]:
df['age']

0    33.0
1    55.0
2    63.0
3    36.0
4     NaN
5     NaN
6     NaN
Name: age, dtype: float64

In [34]:
df['age'].mean()

46.75